'use strict;'
/**
*
			Объявление функций приложения. Делаем в начале, так как, например, into() используется при формировании html-странички.
*
*/

//localStorage.clear();
//Запись в базу
function set(key,value)
{
	localStorage.setItem(key, value);		
}
//Извлечение из базы
function get(key)
{
	return localStorage.getItem(key);
}
//записать в базу id выбраного в стартовом меню рецепта. Старое значение при этом затирается.
function set_recipe(recipe_id)
{
	let id = recipe_id.toString();
	localStorage.setItem('recipe', recipe_id.match(/\d+/));
}
//Извлечь из базы выбраный рецепт. Если не выбран ни один, отключить кнопку "run".
function get_recipe()
{
	if (get('recipe') !== null)
	{
		return get('recipe');
	}
	else
	{
		set('btn_run_background', '#fff');
	}
}
//Аналог isset() из PHP
function isset(value)
{
	if(typeof(get(value)) != "undefined" && get(value) !== null)
		return true;
	else
		return false;
}

// <script>into(value)</script> - вставляет значение переменной в html, похоже по действию на <?=$value;?>  из PHP
function into(value)
{
	document.write(value);
}

//ассоциативный массив, реализующий мультиязычность приложения. Какждая переменная - массив из трех значений: [0] - для языка по-умолчанию(в данном случае - русский), [1] - английский, [2] - украинский. Имена переменных соответствуют id элемента в html.
let data = {
	
	'text_begin': //Привественный alert в начале
	
	['Представьте, что Вам нужно смешать два ингредиента - основу и присадку. Причем, основы берется всегда 100 массовых частей, а присадки  от 1 до 10 массовых частей (1%-10%), в зависимости от выбранного рецепта. Данное приложение эмулирует работу такой системы. Для начала работы воспользуйтесь меню (кликните на значок слева-вверху)',
	
	'Imagine that you need to mix two ingredients - base and additive. Moreover, the base is always taken in 100 parts by weight, and the additives are from 1 to 10 parts by weight (1% -10%), depending on the selected recipe. This application emulates the operation of such a system. To get started, use the menu (push on icon at the top left)',
	
	'Уявіть, що Вам потрібно змішати два інгредієнти - основу і присадку. Причому, основи береться завжди 100 масових частин, а присадки від 1 до 10 масових частин (1% -10%), в залежності від обраного рецепта. Цей додаток емулює роботу такої системи. Для початку роботи скористайтеся меню (натисніть на іконку зліва-вгорі)'],
	
	'menu':
	
	[	'****************\n\tменю\n________________',
		'****************\n\tmenu\n________________',
		'****************\n\tменю\n________________'
	],
				
	'how_use': 
	
	[	'Как пользоваться:',
		'How to use:',
		'Як користуватися:'
	],
	'how_use_1': 
	
	[	' - Включить систему("on")',
		' - Turn on the system("on")',
		' - Увімкніть систему("on")'
	],
	'how_use_2': 
	
	[	' - Загрузить присадку("load 1")',
		' - Download Additive("load 1")',
		' - Завантажте присадку("load 1")'
	],
	'how_use_3': 
	
	[	' - Загрузить основу("load 2")',
		' - Download base("load 2")',
		' - Завантажте основу("load 2")'
	],
	'how_use_4': 
	
	[	' - Выбрать % присадки',
		' - Select % additive',
		' - Выберіть % присадки'
	],
	'how_use_5': 
	
	[	' - Запустить процесс("run")',
		' - Start the process("run")',
		' - Запустіть процесс("run")'
	],
	'how_much_add': 
	
	[	'Сколько присадки?',
		'How much additive?',
		'Скільки присадки?'
	],
	'on': 
	
	[	'вкл',
		'on',
		'ввімк'
	],
	'run': 
	
	[	'старт',
		'run',
		'старт'
	],
	'off': 
	
	[	'выкл',
		'off',
		'вимк'
	],
	'load_1': 
	
	[	'загр 1',
		'load 1',
		'зав 1'
	],
	'load_2': 
	
	[	'загр 2',
		'load 2',
		'зав 2'
	],
	'sanit': 
	
	[	'санит',
		'sanit',
		'саніт'
	],
	'sanit_title': 
	
	[	'*******************************************\n\t Режим санитарной обработки нужен\n\t для очистки всей системы проточной \n\t водой от остатков ингредиентов \n___________________________________________',
		'*******************************************\n\t The sanitization mode is needed\n\t to clean the entire system with running \n\t water from the remaining ingredients \n___________________________________________',
		'*******************************************\n\t Режим санітарної обробки потрібен\n\t для очищення всієї системи проточною \n\t водою від залишків інгредієнтів \n___________________________________________'
	],
	'niotech':
	[
		'***********************************\n\tВсе права защищены © 2021\n\tПишите: woxx13@gmail.com\n___________________________________',
		'********************************\n\tAll rights reserved © 2021\n\tWrite: woxx13@gmail.com\n________________________________',
		'***********************************\n\tВсі права захищені © 2021\n\tПишіть: woxx13@gmail.com\n___________________________________'
	],
	
				
};   